""" docstrings """

"""
NOTE: Здесь описываем базово основные методы с параметрами
В вольном формате =)
"""

"""
Метод для сокращения текста
:method 
:name lib/summ/summarise
:param required*: {str} Какой-нибудь обязательный параметр
:param optional: {str} Какой-нибудь опциональный параметр
:return: {str} возвращает сокращенный текст
"""

"""
Метод для конфигурации модуля
:void
:name lib/summ/config
:param required*: {str} Какой-нибудь обязательный параметр
:param optional: {int} Какой-нибудь опциональный параметр
"""